Autodesk.Revit.DB.AppearanceAssetElement.GetAppearanceAssetElementByName(Autodesk.Revit.DB.Document,System.String)
Gets an AppearanceAssetElement by name.
Remarks:
Returns NULL is there is no AppearanceAssetElement with the specified name.
doc:
Document containing the AppearanceAssetElement.
name:
Name of the AppearanceAssetElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.AppearanceAssetElement.GetRenderingAsset
Gets the rendering asset for the appearance asset element.
Remarks:
The retrieved Asset may be empty if it is loaded from material library without any modification.
In this case, you can use Application.get_Assets(AssetType.Appearance) to load all preset appearance assets, and retrieve the asset by its name.
Returns:
The rendering asset held by this appearance asset element.
Since:
2014

Autodesk.Revit.DB.AppearanceAssetElement.SetRenderingAsset(Autodesk.Revit.Utility.Asset)
Sets the rendering asset for the appearance asset element.
asset:
The new rendering asset.It should be an appearance asset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The asset is not an appearance asset.
Since:
2014

Autodesk.Revit.DB.AppearanceAssetElement.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.Utility.Asset)
Creates a new AppearancAssetElement.
document:
The document in which to create the AppearanceAssetElement.
name:
The name of the AppearanceAssetElement.
asset:
The rendering asset of the element.
Returns:
The new AppearanceAssetElement.
Note that document will own this pointer, you should access it without owning it.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as an appearance asset name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.AppearanceAssetElement
An element that represents an appearance asset for use in composing material definitions.
Since:
2014